tangyangguang/Esp32_Faucet/src/web/FaucetWeb.cpp
std::uint32_t percentOf(std::uint32_t value, std::uint32_t total) {
    if (total == 0) {
        return 0;
    }
    const std::uint64_t percent = (static_cast<std::uint64_t>(value) * 100ULL) / total;
    return percent > 100ULL ? 100UL : static_cast<std::uint32_t>(percent);
}

void sendStatBar(const char* label, const char* value, std::uint32_t percent) {
    sendFmt("<div class='stat-bar'><div class='stat-bar-head'><span>%s</span><strong>%s</strong></div>"
            "<div class='progress'><span style='width:%lu%%'></span></div></div>",
            label,
            value,
            static_cast<unsigned long>(percent));
}

void addSaturating(std::uint32_t& target, std::uint32_t value) {
    const std::uint32_t max = UINT32_MAX;
    target = max - target < value ? max : target + value;
}

bool waterTaskActive() {
    if (!g_context.app) {
        return false;
    }
    const WaterState state = g_context.app->snapshot().water.state;
    return state == WaterState::Confirm || state == WaterState::Running || state == WaterState::Paused;
}

bool sameWaterRecordIdentity(const WaterRecord& a, const WaterRecord& b) {
    return a.startTime == b.startTime && a.volumeMl == b.volumeMl && a.targetValue == b.targetValue &&
           a.pulseCount == b.pulseCount && a.durationSec == b.durationSec && a.selectedPreset == b.selectedPreset &&
           a.result == b.result;
}

std::uint32_t pulsePerLiterFromPulsePerMl(float pulsePerMl) {
    if (!std::isfinite(pulsePerMl) || pulsePerMl <= 0.0f) {
        return 0;
    }
    return static_cast<std::uint32_t>(std::lround(pulsePerMl * 1000.0f));
}

bool findRecordCalibration(const WaterRecord& record, WaterRecordCalibration& calibration) {
    return g_context.recordCalibrations && g_context.recordCalibrations->ready() &&
           g_context.recordCalibrations->find(record, calibration);
}

std::uint32_t actualMlForSegmentedSample(const WaterPulseTrace& trace) {
    if (trace.actualMl > 0) {
        return trace.actualMl;
    }
    WaterRecordCalibration calibration{};
    return findRecordCalibration(trace.record, calibration) ? calibration.actualMl : 0;
}

void indexPagePulseTraces(const WaterRecord* records,
                          std::size_t recordCount,
                          const WaterPulseTraceStore* store,
                          const WaterPulseTrace** output) {
    if (!output) {
        return;
    }
    for (std::size_t i = 0; i < recordCount; ++i) {
        output[i] = nullptr;
    }
    if (!records || !store || recordCount == 0) {
        return;
    }
    const std::size_t traceCount = store->count();
    for (std::size_t traceIndex = 0; traceIndex < traceCount; ++traceIndex) {
        const WaterPulseTrace* trace = store->traceAt(traceIndex);
        if (!trace || !trace->finished) {
            continue;
        }
        for (std::size_t i = 0; i < recordCount; ++i) {
            if (!output[i] && sameWaterRecordIdentity(trace->record, records[i])) {
                output[i] = trace;
            }
        }
    }
}

std::uint32_t measuredPulsePerLiter(const WaterRecord& record, const WaterRecordCalibration& calibration) {
    if (record.pulseCount == 0 || calibration.actualMl == 0) {
        return 0;
    }
    return static_cast<std::uint32_t>(
        (static_cast<std::uint64_t>(record.pulseCount) * 1000ULL + calibration.actualMl / 2ULL) /
        calibration.actualMl);
}

bool saveRecordActualMeasurement(const WaterRecord& record, std::uint32_t actualMl) {
    if (!g_context.config || !g_context.recordCalibrationWriter) {
        return false;
    }
    WaterRecordCalibration calibration = makeWaterRecordCalibration(record);
    calibration.actualMl = actualMl;
    calibration.calibratedAt = g_context.nowSeconds ? g_context.nowSeconds() : 0;
    calibration.oldPulsePerMl = g_context.config->pulsePerMl;
    calibration.newPulsePerMl = g_context.config->pulsePerMl;
    calibration.oldStartupCompensationMl = g_context.config->startupCompensationMl;
    calibration.newStartupCompensationMl = g_context.config->startupCompensationMl;
    calibration.kind = WaterRecordCalibrationKind::PulsePerMl;
    return g_context.recordCalibrationWriter->upsert(calibration);
}

bool ensureSavedPulseTracesReady() {
    if (!g_context.savedPulseTraces) {
        return false;
    }
    return g_context.savedPulseTraces->ready() || g_context.savedPulseTraces->begin();
}

bool copyRamTraceSamples(const WaterPulseTrace& trace, WaterPulseTraceSample* output, std::size_t outputCapacity) {
    if (!g_context.pulseTraces || !output || outputCapacity < trace.sampleCount) {
        return false;
    }
    for (std::size_t i = 0; i < trace.sampleCount; ++i) {
        const WaterPulseTraceSample* sample = g_context.pulseTraces->sampleAt(trace, i);
        if (!sample) {
            return false;
        }
        output[i] = *sample;
    }
    return true;
}

bool copySavedTraceSamples(const WaterPulseTrace& trace, WaterPulseTraceSample* output, std::size_t outputCapacity) {
    return g_context.savedPulseTraces && output && outputCapacity >= trace.sampleCount &&
           g_context.savedPulseTraces->readSamples(trace.traceId, output, outputCapacity) == trace.sampleCount;
}

bool autoSaveTraceAsSegmentedSample(const WaterRecord& record, std::uint32_t actualMl) {
    bool updated = false;
    const WaterPulseTrace* ramTrace = g_context.pulseTraces ? g_context.pulseTraces->findByRecord(record) : nullptr;
    if (g_context.pulseTraces && g_context.pulseTraces->setActualMlByRecord(record, actualMl)) {
        updated = true;
        ramTrace = g_context.pulseTraces->findByRecord(record);
    }

    if (!ensureSavedPulseTracesReady()) {
        return updated;
    }

    WaterPulseTrace savedTrace{};
    if (g_context.savedPulseTraces->findByRecord(record, savedTrace)) {
        return g_context.savedPulseTraces->setActualMl(savedTrace.traceId, actualMl) || updated;
    }
    if (!ramTrace || ramTrace->sampleCount == 0 ||
        ramTrace->sampleCount > g_context.savedPulseTraces->sampleCapacityPerTrace()) {
        return updated;
    }

    WaterPulseTraceSample* samples = new (std::nothrow) WaterPulseTraceSample[ramTrace->sampleCount]{};
    if (!samples) {
        return updated;
    }
    const bool copied = copyRamTraceSamples(*ramTrace, samples, ramTrace->sampleCount);
    std::uint32_t savedTraceId = 0;
    WaterPulseTraceSaveStatus status = WaterPulseTraceSaveStatus::Ok;
    const bool saved =
        copied && g_context.savedPulseTraces->save(*ramTrace, samples, ramTrace->sampleCount, &savedTraceId, &status);
    delete[] samples;
    return updated || saved;
}

