tangyangguang/Esp32_Faucet/src/web/FaucetWeb.cpp
bool segmentedSampleAlreadySeen(const WaterRecord* records, std::size_t count, const WaterRecord& record) {
    for (std::size_t i = 0; i < count; ++i) {
        if (sameWaterRecordIdentity(records[i], record)) {
            return true;
        }
    }
    return false;
}

bool appendSegmentedSampleFromTrace(const WaterPulseTrace& trace,
                                    bool savedSource,
                                    SegmentedCalibrationSample* samples,
                                    WaterRecord* seenRecords,
                                    std::size_t& seenCount,
                                    std::size_t& sampleCount,
                                    SegmentedSampleDiagnostics& diagnostics) {
    if (!samples || !seenRecords || seenCount >= kSegmentedCalibrationMaxSamples ||
        segmentedSampleAlreadySeen(seenRecords, seenCount, trace.record)) {
        return false;
    }
    seenRecords[seenCount] = trace.record;
    ++seenCount;

    const std::uint32_t actualMl = actualMlForSegmentedSample(trace);
    if (actualMl > 0) {
        ++diagnostics.measuredSampleCount;
    }
    if (sampleCount >= kSegmentedCalibrationMaxSamples || actualMl == 0 || trace.sampleCount < 6 ||
        trace.totalPulses == 0) {
        return false;
    }
    WaterPulseTraceSample* traceSamples = new (std::nothrow) WaterPulseTraceSample[trace.sampleCount]{};
    if (!traceSamples) {
        return false;
    }
    const bool copied = savedSource ? copySavedTraceSamples(trace, traceSamples, trace.sampleCount)
                                    : copyRamTraceSamples(trace, traceSamples, trace.sampleCount);
    if (!copied) {
        delete[] traceSamples;
        return false;
    }
    const WaterPulseTraceAnalysis analysis = analyzeWaterPulseTrace(trace, traceSamples, trace.sampleCount);
    delete[] traceSamples;
    if (!analysis.stable || analysis.stablePulseCount == 0) {
        return false;
    }
    samples[sampleCount] = SegmentedCalibrationSample{
        actualMl,
        trace.totalPulses,
        analysis.startupPulseCount,
        analysis.stablePulseCount,
        analysis.stableStartSec,
    };
    ++sampleCount;
    diagnostics.validSampleCount = static_cast<std::uint16_t>(sampleCount);
    if (trace.startTime >= diagnostics.latestSampleTime) {
        diagnostics.latestSampleTime = trace.startTime;
        diagnostics.latestActualMl = actualMl;
    }
    return true;
}

SegmentedSampleDiagnostics collectSegmentedSampleDiagnostics(bool includeRam = true) {
    SegmentedSampleDiagnostics diagnostics{};
    SegmentedCalibrationSample samples[kSegmentedCalibrationMaxSamples]{};
    WaterRecord seenRecords[kSegmentedCalibrationMaxSamples]{};
    std::size_t seenCount = 0;
    std::size_t sampleCount = 0;

    if (ensureSavedPulseTracesReady()) {
        WaterPulseTrace* savedTraces = new (std::nothrow) WaterPulseTrace[kSavedPulseTraceMaxCountLimit]{};
        if (savedTraces) {
            const std::size_t savedCount =
                g_context.savedPulseTraces->list(savedTraces, kSavedPulseTraceMaxCountLimit);
            diagnostics.savedTraceCount = static_cast<std::uint16_t>(
                std::min<std::size_t>(savedCount, static_cast<std::size_t>(UINT16_MAX)));
            for (std::size_t i = 0; i < savedCount && sampleCount < kSegmentedCalibrationMaxSamples; ++i) {
                appendSegmentedSampleFromTrace(
                    savedTraces[i], true, samples, seenRecords, seenCount, sampleCount, diagnostics);
            }
            delete[] savedTraces;
        }
    }

    if (includeRam && g_context.pulseTraces) {
        for (std::size_t offset = 0;
             offset < g_context.pulseTraces->count() && sampleCount < kSegmentedCalibrationMaxSamples;
             ++offset) {
            const std::size_t index = g_context.pulseTraces->count() - 1 - offset;
            const WaterPulseTrace* trace = g_context.pulseTraces->traceAt(index);
            if (trace) {
                appendSegmentedSampleFromTrace(*trace, false, samples, seenRecords, seenCount, sampleCount, diagnostics);
            }
        }
    }

    computeSegmentedCalibration(samples, sampleCount, diagnostics.result);
    diagnostics.validSampleCount = static_cast<std::uint16_t>(sampleCount);
    return diagnostics;
}

bool applySegmentedCalibrationFromAvailableSamples() {
    if (!g_context.config) {
        return false;
    }
    const SegmentedSampleDiagnostics diagnostics = collectSegmentedSampleDiagnostics();
    if (!diagnostics.result.valid) {
        return false;
    }
    SystemConfig next = *g_context.config;
    next.overallPulsePerLiter = diagnostics.result.overallPulsePerLiter;
    next.startupDurationSec = diagnostics.result.startupDurationSec;
    next.startupPulseCount = diagnostics.result.startupPulseCount;
    next.startupVolumeMl = diagnostics.result.startupVolumeMl;
    next.startupPulsePerLiter = diagnostics.result.startupPulsePerLiter;
    next.stablePulsePerLiter = diagnostics.result.stablePulsePerLiter;
    next.segmentedMeteringCalibrated = true;
    return persistConfig(next);
}

bool syncSegmentedCalibrationFromActual(const WaterRecord& record, std::uint32_t actualMl) {
    const bool sampleSynced = autoSaveTraceAsSegmentedSample(record, actualMl);
    const bool fitted = applySegmentedCalibrationFromAvailableSamples();
    return sampleSynced || fitted;
}

std::uint32_t startupCompensationFromSegmentedParams(std::uint32_t startupVolumeMl,
                                                     std::uint32_t startupPulseCount,
                                                     std::uint32_t stablePulsePerLiter) {
    if (startupVolumeMl == 0 || startupPulseCount == 0 || stablePulsePerLiter == 0) {
        return 0;
    }
    const std::uint32_t startupPulseMl =
        static_cast<std::uint32_t>((static_cast<std::uint64_t>(startupPulseCount) * 1000ULL +
                                    stablePulsePerLiter / 2ULL) /
                                   stablePulsePerLiter);
    const std::uint32_t compensation =
        startupVolumeMl > startupPulseMl ? startupVolumeMl - startupPulseMl : 0;
    return std::min<std::uint32_t>(compensation, kMaxStartupCompensationMl);
}

void storeSegmentedCandidate(SystemConfig& config, const SegmentedCalibrationResult& result) {
    config.segmentedCandidateReady = result.valid;
    config.candidateOverallPulsePerLiter = result.overallPulsePerLiter;
    config.candidateStartupDurationSec = result.startupDurationSec;
    config.candidateStartupPulseCount = result.startupPulseCount;
    config.candidateStartupVolumeMl = result.startupVolumeMl;
    config.candidateStartupPulsePerLiter = result.startupPulsePerLiter;
    config.candidateStablePulsePerLiter = result.stablePulsePerLiter;
    config.candidateSampleCount = result.sampleCount;
    config.candidateMinActualMl = result.minActualMl;
    config.candidateMaxActualMl = result.maxActualMl;
    config.candidateMaxErrorMl = result.maxErrorMl;
    config.candidateGeneratedAt = g_context.nowSeconds ? g_context.nowSeconds() : 0;
}

bool generateSegmentedCalibrationCandidateFromSavedSamples() {
    if (!g_context.config) {
        return false;
    }
    const SegmentedSampleDiagnostics diagnostics = collectSegmentedSampleDiagnostics(false);
    if (!diagnostics.result.valid) {
        return false;
    }
    SystemConfig next = *g_context.config;
    storeSegmentedCandidate(next, diagnostics.result);
    return persistConfig(next);
}

bool applySegmentedCalibrationCandidate() {
    if (!g_context.config || !g_context.config->segmentedCandidateReady) {
        return false;
    }
    const SystemConfig& config = *g_context.config;
    SystemConfig next = config;
    next.segmentedPreviousReady = true;
    next.previousSegmentedMeteringCalibrated = config.segmentedMeteringCalibrated;
    next.previousPulsePerMl = config.pulsePerMl;
    next.previousStartupCompensationMl = config.startupCompensationMl;
    next.previousOverallPulsePerLiter = config.overallPulsePerLiter;
    next.previousStartupDurationSec = config.startupDurationSec;
    next.previousStartupPulseCount = config.startupPulseCount;
    next.previousStartupVolumeMl = config.startupVolumeMl;
    next.previousStartupPulsePerLiter = config.startupPulsePerLiter;
    next.previousStablePulsePerLiter = config.stablePulsePerLiter;

    next.overallPulsePerLiter = config.candidateOverallPulsePerLiter;
    next.startupDurationSec = config.candidateStartupDurationSec;
    next.startupPulseCount = config.candidateStartupPulseCount;
    next.startupVolumeMl = config.candidateStartupVolumeMl;
    next.startupPulsePerLiter = config.candidateStartupPulsePerLiter;
    next.stablePulsePerLiter = config.candidateStablePulsePerLiter;
    next.segmentedMeteringCalibrated = true;
    if (config.candidateStablePulsePerLiter > 0) {
        next.pulsePerMl = static_cast<float>(config.candidateStablePulsePerLiter) / 1000.0f;
    }
    next.startupCompensationMl = startupCompensationFromSegmentedParams(
        config.candidateStartupVolumeMl, config.candidateStartupPulseCount, config.candidateStablePulsePerLiter);
    return persistConfig(next);
}

