tangyangguang/Esp32_Faucet/src/web/FaucetWeb.cpp
bool restorePreviousSegmentedCalibration() {
    if (!g_context.config || !g_context.config->segmentedPreviousReady) {
        return false;
    }
    const SystemConfig& config = *g_context.config;
    SystemConfig next = config;
    next.segmentedMeteringCalibrated = config.previousSegmentedMeteringCalibrated;
    next.pulsePerMl = config.previousPulsePerMl;
    next.startupCompensationMl = config.previousStartupCompensationMl;
    next.overallPulsePerLiter = config.previousOverallPulsePerLiter;
    next.startupDurationSec = config.previousStartupDurationSec;
    next.startupPulseCount = config.previousStartupPulseCount;
    next.startupVolumeMl = config.previousStartupVolumeMl;
    next.startupPulsePerLiter = config.previousStartupPulsePerLiter;
    next.stablePulsePerLiter = config.previousStablePulsePerLiter;
    next.segmentedPreviousReady = false;
    return persistConfig(next);
}

void sendSignedLiters(std::int32_t ml) {
    if (ml < 0) {
        Esp32BaseWeb::sendChunk("-");
        sendLiters(static_cast<std::uint32_t>(-ml));
        return;
    }
    Esp32BaseWeb::sendChunk("+");
    sendLiters(static_cast<std::uint32_t>(ml));
}

bool shouldShowTargetDelta(const WaterRecord& record) {
    if (record.mode != WaterMode::Volume || record.targetValue == 0) {
        return false;
    }
    const std::int32_t diff =
        static_cast<std::int32_t>(record.volumeMl) - static_cast<std::int32_t>(record.targetValue);
    const std::uint32_t absDiff = diff < 0 ? static_cast<std::uint32_t>(-diff) : static_cast<std::uint32_t>(diff);
    return absDiff >= 100UL && absDiff * 100UL >= record.targetValue * 3UL;
}

void sendTargetDeltaHint(const WaterRecord& record) {
    if (!shouldShowTargetDelta(record)) {
        return;
    }
    const std::int32_t diff =
        static_cast<std::int32_t>(record.volumeMl) - static_cast<std::int32_t>(record.targetValue);
    Esp32BaseWeb::sendChunk("<small class='hint'>较目标 ");
    sendSignedLiters(diff);
    Esp32BaseWeb::sendChunk("</small>");
}

const char* traceStateText(WaterPulseTraceState state) {
    switch (state) {
        case WaterPulseTraceState::Running:
            return "运行";
        case WaterPulseTraceState::Paused:
            return "暂停";
        case WaterPulseTraceState::Completed:
            return "完成";
        case WaterPulseTraceState::Stopped:
            return "停止";
        case WaterPulseTraceState::PauseTimeout:
            return "暂停超时";
        case WaterPulseTraceState::SafetyStopped:
            return "安全停止";
        case WaterPulseTraceState::Error:
        default:
            return "异常";
    }
}

void sendPlainTextResponse(int status, const char* body) {
    Esp32BaseWeb::sendResponseHeader("Cache-Control", "no-store");
    Esp32BaseWeb::sendResponseHeader("X-Content-Type-Options", "nosniff");
    if (!Esp32BaseWeb::beginResponse(status, "text/plain; charset=utf-8", nullptr)) {
        return;
    }
    Esp32BaseWeb::sendChunk(body ? body : "");
    Esp32BaseWeb::endResponse();
}

std::size_t rawTracePreviewSampleCount(const WaterPulseTrace& trace) {
    const std::size_t previewLimit = kRawTracePreviewLastSecond + 1U;
    return std::min(trace.sampleCount, previewLimit);
}

void sendPulseTraceRawText(const WaterPulseTrace& trace,
                           const WaterPulseTraceSample* samples,
                           bool rawTraceShowAll) {
    Esp32BaseWeb::sendResponseHeader("Cache-Control", "no-store");
    Esp32BaseWeb::sendResponseHeader("X-Content-Type-Options", "nosniff");
    if (!Esp32BaseWeb::beginResponse(200, "text/plain; charset=utf-8", nullptr)) {
        return;
    }
    Esp32BaseWeb::sendChunk("时间\t脉冲数\t累计脉冲数\t状态\n");
    std::uint32_t cumulative = 0;
    const std::size_t sampleCount = rawTraceShowAll ? trace.sampleCount : rawTracePreviewSampleCount(trace);
    for (std::size_t i = 0; i < sampleCount; ++i) {
        cumulative += samples[i].pulseDelta;
        sendFmt("%lu秒\t%u\t%lu\t%s\n",
                static_cast<unsigned long>(i),
                static_cast<unsigned>(samples[i].pulseDelta),
                static_cast<unsigned long>(cumulative),
                traceStateText(samples[i].state));
    }
    if (!rawTraceShowAll && trace.sampleCount > sampleCount) {
        sendFmt("仅显示 0秒 到 %lu秒，共 %lu 行；完整明细请使用 all=1。\n",
                static_cast<unsigned long>(kRawTracePreviewLastSecond),
                static_cast<unsigned long>(sampleCount));
    }
    Esp32BaseWeb::endResponse();
}

std::uint32_t bucketRunningPulseDelta(const WaterPulseTraceSample* samples,
                                      std::size_t sampleCount,
                                      const WaterPulseTraceBucket& bucket) {
    if (!samples || sampleCount == 0) {
        return bucket.state == WaterPulseTraceState::Running ? bucket.pulseDelta : 0;
    }
    const std::size_t begin = std::min<std::size_t>(sampleCount, bucket.startSec);
    const std::size_t end = std::min<std::size_t>(sampleCount, begin + bucket.durationSec);
    std::uint32_t total = 0;
    for (std::size_t i = begin; i < end; ++i) {
        if (samples[i].state == WaterPulseTraceState::Running) {
            total += samples[i].pulseDelta;
        }
    }
    return total;
}

bool bucketOnlyHasRunningSamples(const WaterPulseTraceSample* samples,
                                 std::size_t sampleCount,
                                 const WaterPulseTraceBucket& bucket) {
    if (!samples || sampleCount == 0) {
        return bucket.state == WaterPulseTraceState::Running;
    }
    const std::size_t begin = std::min<std::size_t>(sampleCount, bucket.startSec);
    const std::size_t end = std::min<std::size_t>(sampleCount, begin + bucket.durationSec);
    if (begin >= end) {
        return false;
    }
    for (std::size_t i = begin; i < end; ++i) {
        if (samples[i].state != WaterPulseTraceState::Running) {
            return false;
        }
    }
    return true;
}

void formatKb(std::size_t bytes, char* out, std::size_t len) {
    const std::uint32_t tenths = static_cast<std::uint32_t>((bytes * 10U + 512U) / 1024U);
    std::snprintf(out, len, "%lu.%luKB", static_cast<unsigned long>(tenths / 10U),
                  static_cast<unsigned long>(tenths % 10U));
}

void sendSegmentedMeteringPanel() {
    const SystemConfig& config = *g_context.config;
    const SegmentedSampleDiagnostics diagnostics = collectSegmentedSampleDiagnostics(false);
    const SegmentedCalibrationResult& scanned = diagnostics.result;
    const bool candidateReady = config.segmentedCandidateReady;
    const bool parameterReady = candidateReady || config.segmentedMeteringCalibrated;
    const bool canGenerate = scanned.valid;
    const std::uint32_t stablePulsePerLiter =
        candidateReady ? config.candidateStablePulsePerLiter : config.stablePulsePerLiter;
    const std::uint32_t startupVolumeMl =
        candidateReady ? config.candidateStartupVolumeMl : config.startupVolumeMl;
    const std::uint32_t startupPulseCount =
        candidateReady ? config.candidateStartupPulseCount : config.startupPulseCount;
    const std::uint32_t startupDurationSec =
        candidateReady ? config.candidateStartupDurationSec : config.startupDurationSec;
    const std::uint32_t overallPulsePerLiter =
        candidateReady ? config.candidateOverallPulsePerLiter : config.overallPulsePerLiter;
    char control[24]{};
    char stable[24]{};
    char startup[64]{};
    char effectiveSamples[64]{};
    char sampleNeed[48]{};
    char compensation[24]{};
    char error[24]{};
    char overall[24]{};
    std::snprintf(control,
                  sizeof(control),
                  "%luP/L",
                  static_cast<unsigned long>(pulsePerLiterFromPulsePerMl(config.pulsePerMl)));
    std::snprintf(stable,
                  sizeof(stable),
                  stablePulsePerLiter == 0 ? "待拟合" : "%luP/L",
                  static_cast<unsigned long>(stablePulsePerLiter));
    if (startupDurationSec > 0 || startupPulseCount > 0 || startupVolumeMl > 0) {
        char volume[24]{};
        formatLiters(startupVolumeMl, volume, sizeof(volume));
        std::snprintf(startup,
                      sizeof(startup),
                      "%s / %lus / %luP",
                      volume,
                      static_cast<unsigned long>(startupDurationSec),
                      static_cast<unsigned long>(startupPulseCount));
    } else {
        std::snprintf(startup, sizeof(startup), "待拟合");
    }
    if (candidateReady) {
        char minVolume[24]{};
        char maxVolume[24]{};
        formatLiters(config.candidateMinActualMl, minVolume, sizeof(minVolume));
        formatLiters(config.candidateMaxActualMl, maxVolume, sizeof(maxVolume));
        std::snprintf(effectiveSamples,
                      sizeof(effectiveSamples),
                      "%u条 / %s-%s",
                      static_cast<unsigned>(config.candidateSampleCount),
                      minVolume,
                      maxVolume);
        std::snprintf(sampleNeed, sizeof(sampleNeed), "0条");
    } else {
        std::snprintf(effectiveSamples,
                      sizeof(effectiveSamples),
                      "%u/%u 条",
                      static_cast<unsigned>(diagnostics.validSampleCount),
                      static_cast<unsigned>(kSegmentedCalibrationRequiredSamples));
        if (diagnostics.validSampleCount < kSegmentedCalibrationRequiredSamples) {
            std::snprintf(sampleNeed,
                          sizeof(sampleNeed),
                          "%u条有效样本",
                          static_cast<unsigned>(kSegmentedCalibrationRequiredSamples - diagnostics.validSampleCount));
        } else {
            std::snprintf(sampleNeed, sizeof(sampleNeed), "容量差异>0.50 L的样本");
        }
    }
    if (stablePulsePerLiter > 0 && startupVolumeMl > 0) {
        const std::uint32_t compensationMl =
            startupCompensationFromSegmentedParams(startupVolumeMl, startupPulseCount, stablePulsePerLiter);
        formatLiters(compensationMl, compensation, sizeof(compensation));
    } else {
        std::snprintf(compensation, sizeof(compensation), "-");
    }
    if (candidateReady) {
        std::snprintf(error, sizeof(error), "±%luml", static_cast<unsigned long>(config.candidateMaxErrorMl));
    } else {
        std::snprintf(error, sizeof(error), "-");
    }
    std::snprintf(overall,
                  sizeof(overall),
                  overallPulsePerLiter == 0 ? "-" : "%luP/L",
                  static_cast<unsigned long>(overallPulsePerLiter));
    Esp32BaseWeb::sendChunk("<section class='panel records-diagnostic-panel metering-diagnostic'><div class='diagnostic-head'><h3>计量诊断</h3>");
    sendFmt("<span class='status-pill %s'>%s</span></div><div class='diagnostic-metric-grid three'>",
            candidateReady ? "status-ok" : config.segmentedMeteringCalibrated ? "status-ok" : canGenerate ? "status-warn" : "status-muted",
            candidateReady ? "候选已生成" : config.segmentedMeteringCalibrated ? "已应用" : canGenerate ? "可生成" : "样本不足");
    sendFmt("<div class='diagnostic-metric'><span>控制P/L</span><strong>%s</strong></div>", control);
    sendFmt("<div class='diagnostic-metric'><span>稳态P/L</span><strong>%s</strong></div>", stable);
    sendFmt("<div class='diagnostic-metric'><span>启动等效</span><strong>%s</strong></div>", startup);
    sendFmt("<div class='diagnostic-metric'><span>有效样本</span><strong>%s</strong></div>", effectiveSamples);
    Esp32BaseWeb::sendChunk("</div><div class='diagnostic-foot'>");
    sendFmt("<span>已保存明细 <b>%u条</b></span><span>已测容量 <b>%u条</b></span>",
            static_cast<unsigned>(diagnostics.savedTraceCount),
            static_cast<unsigned>(diagnostics.measuredSampleCount));
    if (!candidateReady) {
        sendFmt("<span>还需 <b>%s</b></span>", sampleNeed);
    }
    if (parameterReady) {
        sendFmt("<span>建议补偿 <b>%s</b></span><span>拟合误差 <b>%s</b></span><span>全程平均 <b>%s</b></span>",
                compensation,
                error,
                overall);
    }
    Esp32BaseWeb::sendChunk("</div></section>");
}

void sendPulseTraceCachePanel() {
    WaterPulseTraceStats stats{};
    if (!g_context.pulseTraces) {
        Esp32BaseWeb::sendChunk("<section class='panel records-diagnostic-panel trace-cache-diagnostic'><div class='diagnostic-head'><h3>临时缓存</h3>"
                                "<span class='status-pill status-error'>RAM 不可用</span></div>"
                                "<div class='diagnostic-metric-grid'><div class='diagnostic-metric'><span>明细</span><strong>-</strong></div>"
                                "<div class='diagnostic-metric'><span>数据点</span><strong>-</strong></div></div>"
                                "<div class='diagnostic-foot'><span>占用 <b>-</b></span></div></section>");
    } else {
        stats = g_context.pulseTraces->stats();
        char used[24]{};
        char budget[24]{};
        formatKb(stats.usedBytes, used, sizeof(used));
        formatKb(stats.budgetBytes, budget, sizeof(budget));
        const std::size_t budgetSamples = stats.budgetBytes / sizeof(WaterPulseTraceSample);
        const std::size_t supportedSamples = std::min(stats.sampleCapacity, budgetSamples);
        char traces[24]{};
        char samples[32]{};
        std::snprintf(traces,
                      sizeof(traces),
                      "%lu / %lu 条",
                      static_cast<unsigned long>(stats.traceCount),
                      static_cast<unsigned long>(stats.traceCapacity));
        std::snprintf(samples,
                      sizeof(samples),
                      "%lu / 约%lu 点",
                      static_cast<unsigned long>(stats.sampleCount),
                      static_cast<unsigned long>(supportedSamples));
        Esp32BaseWeb::sendChunk("<section class='panel records-diagnostic-panel trace-cache-diagnostic'><div class='diagnostic-head'><h3>临时缓存</h3>"
                                "<span class='status-pill status-muted ram-badge'>RAM</span></div><div class='diagnostic-metric-grid'>");
        sendFmt("<div class='diagnostic-metric'><span>明细</span><strong>%s</strong></div>", traces);
        sendFmt("<div class='diagnostic-metric'><span>数据点</span><strong>%s</strong></div>", samples);
        sendFmt("</div><div class='diagnostic-foot'><span>占用 <b>%s / %s</b></span><span><b>%u%%</b></span></div></section>",
                used,
                budget,
                static_cast<unsigned>(stats.usagePercent));
    }

