tangyangguang/Esp32_Faucet/src/web/FaucetWeb.cpp
    WaterPulseTraceSample* samples = new (std::nothrow) WaterPulseTraceSample[trace->sampleCount]{};
    if (!samples) {
        delete[] samples;
        if (rawRequest) {
            sendPlainTextResponse(500, "内存不足，无法生成脉冲明细。\n");
            return;
        }
        Esp32BaseWeb::sendHeader("脉冲明细");
        Esp32BaseWeb::sendChunk("<p class='err'>内存不足，无法生成脉冲明细。</p>");
        sendPageEnd();
        return;
    }
    if (savedSource) {
        if (!g_context.savedPulseTraces ||
            g_context.savedPulseTraces->readSamples(trace->traceId, samples, trace->sampleCount) != trace->sampleCount) {
            delete[] samples;
            if (rawRequest) {
                sendPlainTextResponse(500, "已保存明细读取失败。\n");
                return;
            }
            Esp32BaseWeb::sendHeader("脉冲明细");
            Esp32BaseWeb::sendChunk("<p class='err'>已保存明细读取失败。</p>");
            sendPageEnd();
            return;
        }
    } else {
        for (std::size_t i = 0; i < trace->sampleCount; ++i) {
            const WaterPulseTraceSample* sample = g_context.pulseTraces ? g_context.pulseTraces->sampleAt(*trace, i) : nullptr;
            samples[i] = sample ? *sample : WaterPulseTraceSample{};
        }
    }
    if (rawRequest) {
        sendPulseTraceRawText(*trace, samples, rawTraceShowAll);
        delete[] samples;
        return;
    }
    WaterPulseTraceBucket* buckets = new (std::nothrow) WaterPulseTraceBucket[trace->sampleCount]{};
    if (!buckets) {
        delete[] samples;
        Esp32BaseWeb::sendHeader("脉冲明细");
        Esp32BaseWeb::sendChunk("<p class='err'>内存不足，无法生成脉冲明细。</p>");
        sendPageEnd();
        return;
    }
    const std::size_t bucketCount =
        aggregateWaterPulseTrace(*trace, samples, trace->sampleCount, bucketSeconds, buckets, trace->sampleCount);
    const WaterPulseTraceAnalysis analysis = analyzeWaterPulseTrace(*trace, samples, trace->sampleCount);

    char startTime[40]{};
    formatWaterRecordTime(trace->record, startTime, sizeof(startTime));
    const std::size_t traceBytes = sizeof(WaterPulseTrace) + trace->sampleCount * sizeof(WaterPulseTraceSample);
    char traceKb[24]{};
    formatKb(traceBytes, traceKb, sizeof(traceKb));
    const bool savedStoreReady = ensureSavedPulseTracesReady();
    const bool alreadySaved = savedStoreReady && g_context.savedPulseTraces->containsRecord(trace->record);
    const std::uint32_t traceActualMl = actualMlForSegmentedSample(*trace);
    const bool traceActualSynced = trace->actualMl > 0;
    const bool traceActualFromRecord = !traceActualSynced && traceActualMl > 0;
    Esp32BaseWeb::sendHeader("脉冲明细");
    Esp32BaseWeb::sendChunk("<h2>脉冲明细</h2><div class='form-actions'><a class='btn-link' href='/faucet/records'>返回记录</a>");
    if (savedSource) {
        Esp32BaseWeb::sendChunk("<form method='post' action='/api/faucet/records' onsubmit=\"return confirm('确认删除这条已保存的脉冲明细？')&&once(this)\">"
                                "<input type='hidden' name='action' value='delete'>");
        sendFmt("<input type='hidden' name='trace' value='%lu'><input class='secondary' type='submit' value='删除已保存明细'></form>",
                static_cast<unsigned long>(trace->traceId));
    } else if (savedStoreReady) {
        if (alreadySaved) {
            Esp32BaseWeb::sendChunk("<span class='status-pill status-ok'>已保存到设备</span>");
        } else {
            Esp32BaseWeb::sendChunk("<form method='post' action='/api/faucet/records' onsubmit=\"return confirm('确认将这条脉冲明细保存到设备存储？')&&once(this)\">"
                                    "<input type='hidden' name='action' value='save'>");
            sendFmt("<input type='hidden' name='trace' value='%lu'><input type='submit' value='保存到设备'></form>",
                    static_cast<unsigned long>(trace->traceId));
        }
    } else {
        Esp32BaseWeb::sendChunk("<form method='post' action='/api/faucet/records' onsubmit=\"return confirm('确认将这条脉冲明细保存到设备存储？')&&once(this)\">"
                                "<input type='hidden' name='action' value='save'>");
        sendFmt("<input type='hidden' name='trace' value='%lu'><input type='submit' value='保存到设备'></form>",
                static_cast<unsigned long>(trace->traceId));
    }
    Esp32BaseWeb::sendChunk("</div>");

    Esp32BaseWeb::sendChunk("<section class='panel sample-status-panel'><h3>样本状态</h3><table class='kv'>");
    if (traceActualSynced) {
        Esp32BaseWeb::sendChunk("<tr><th>状态</th><td><span class='status-pill status-ok'>样本已入库</span></td></tr>");
    } else if (traceActualFromRecord) {
        Esp32BaseWeb::sendChunk("<tr><th>状态</th><td><span class='status-pill status-ok'>记录已校准</span></td></tr>");
    } else {
        Esp32BaseWeb::sendChunk("<tr><th>状态</th><td><span class='status-pill status-muted'>未输入实测容量</span></td></tr>"
                                "<tr><th>下一步</th><td>请在校准页输入最新记录的实际出水量。</td></tr>");
    }
    if (traceActualMl > 0) {
        Esp32BaseWeb::sendChunk("<tr><th>实测容量</th><td>");
        sendLitersMl(traceActualMl);
        Esp32BaseWeb::sendChunk("</td></tr>");
        Esp32BaseWeb::sendChunk(traceActualFromRecord
                                    ? "<tr><th>来源</th><td>来自记录容量校准；永久样本由校准页选项决定。</td></tr>"
                                    : "<tr><th>来源</th><td>来自脉冲明细样本库。</td></tr>");
    }
    if (traceActualMl > 0 && analysis.stable) {
        sendFmt("<tr><th>可用性</th><td>可用于拟合，稳态从第 %lu 秒开始。</td></tr>",
                static_cast<unsigned long>(analysis.stableStartSec));
    } else if (analysis.stable) {
        sendFmt("<tr><th>可用性</th><td>脉冲稳定，输入实测容量后可用于拟合；稳态从第 %lu 秒开始。</td></tr>",
                static_cast<unsigned long>(analysis.stableStartSec));
    } else if (traceActualMl > 0) {
        Esp32BaseWeb::sendChunk("<tr><th>可用性</th><td>实测容量已记录，但稳态识别失败，暂不能用于拟合。</td></tr>");
    } else {
        Esp32BaseWeb::sendChunk("<tr><th>可用性</th><td>缺少实测容量且稳态识别失败，暂不能用于拟合。</td></tr>");
    }
    Esp32BaseWeb::sendChunk("</table><p class='hint'>实际容量统一从校准页保存；是否保存为长期样本由容量校准表单控制。</p></section>");

    Esp32BaseWeb::sendChunk("<section class='panel'><h3>明细概况</h3><table class='kv'>");
    sendFmt("<tr><th>开始时间</th><td>%s</td></tr>"
            "<tr><th>目标</th><td>",
            startTime);
    sendTargetValue(trace->record);
    Esp32BaseWeb::sendChunk("</td></tr><tr><th>固件估算</th><td>");
    sendLiters(trace->record.volumeMl);
    sendFmt("</td></tr><tr><th>总脉冲</th><td>%lu</td></tr>"
            "<tr><th>持续时间</th><td>%lu s</td></tr>"
            "<tr><th>样本数</th><td>%lu</td></tr>"
            "<tr><th>本条占用</th><td>%s</td></tr>",
            static_cast<unsigned long>(trace->totalPulses),
            static_cast<unsigned long>(trace->sampleCount),
            static_cast<unsigned long>(trace->sampleCount),
            traceKb);
    if (analysis.stable) {
        sendFmt("<tr><th>稳态开始</th><td>第 %lu 秒，启动段 %lu 脉冲，稳态 %.2f P/s，置信度 %u%%</td></tr>",
                static_cast<unsigned long>(analysis.stableStartSec),
                static_cast<unsigned long>(analysis.startupPulseCount),
                static_cast<double>(analysis.stablePulsePerSec),
                static_cast<unsigned>(analysis.confidence));
    } else {
        Esp32BaseWeb::sendChunk("<tr><th>稳态识别</th><td>无法识别</td></tr>");
    }
    Esp32BaseWeb::sendChunk("</table></section>");

    Esp32BaseWeb::sendChunk("<section class='panel'><div class='panel-head'><h3>脉冲趋势</h3><div class='row-actions trace-frequency'><span class='trace-frequency-label'>聚合频率</span>");
    constexpr std::uint32_t bucketsToShow[] = {1, 2, 3, 4, 5};
    for (std::uint32_t bucket : bucketsToShow) {
        const char* linkClass = bucket == bucketSeconds ? "btn-link page-current" : "btn-link";
        sendFmt("<a class='%s' aria-current='%s' href='/faucet/records/detail?%strace=%lu&bucket=%lu'>%lus</a>",
                linkClass,
                bucket == bucketSeconds ? "true" : "false",
                savedSource ? "saved=1&" : "",
                static_cast<unsigned long>(traceId),
                static_cast<unsigned long>(bucket),
                static_cast<unsigned long>(bucket));
    }
    std::uint32_t maxDelta = 1;
    std::uint32_t maxCumulative = 1;
    std::uint32_t runningCumulative = 0;
    for (std::size_t i = 0; i < bucketCount; ++i) {
        if (!bucketOnlyHasRunningSamples(samples, trace->sampleCount, buckets[i])) {
            continue;
        }
        const std::uint32_t chartDelta = bucketRunningPulseDelta(samples, trace->sampleCount, buckets[i]);
        maxDelta = std::max(maxDelta, chartDelta);
        runningCumulative += chartDelta;
        maxCumulative = std::max(maxCumulative, runningCumulative);
    }
    const std::uint32_t left = 54;
    const std::uint32_t top = 28;
    const std::uint32_t baseY = 224;
    const std::uint32_t chartHeight = 176;
    const std::uint32_t chartWidth = 900;
    const std::uint32_t maxEndSec =
        bucketCount == 0 ? 1 : std::max<std::uint32_t>(1, buckets[bucketCount - 1].startSec + buckets[bucketCount - 1].durationSec);
    Esp32BaseWeb::sendChunk("</div></div><div class='pulse-detail-chart'><svg viewBox='0 0 1000 300' role='img' aria-label='脉冲明细折线图'>"
                            "<line class='axis' x1='54' y1='224' x2='954' y2='224'></line>"
                            "<line class='axis' x1='54' y1='28' x2='54' y2='224'></line>"
                            "<line class='axis' x1='954' y1='28' x2='954' y2='224'></line>");
    for (std::uint32_t i = 1; i <= 4; ++i) {
        const std::uint32_t y = baseY - (chartHeight * i) / 4;
        sendFmt("<line class='grid-line' x1='54' y1='%lu' x2='954' y2='%lu'></line>",
                static_cast<unsigned long>(y),
                static_cast<unsigned long>(y));
    }
    for (std::uint32_t i = 0; i <= 4; ++i) {
        const std::uint32_t y = baseY - (chartHeight * i) / 4;
        const std::uint32_t value = (maxDelta * i + 2U) / 4U;
        sendFmt("<text class='chart-label chart-y-label' x='48' y='%lu'>%lu</text>",
                static_cast<unsigned long>(y + 4U),
                static_cast<unsigned long>(value));
    }
    for (std::uint32_t i = 0; i <= 4; ++i) {
        const std::uint32_t y = baseY - (chartHeight * i) / 4;
        const std::uint32_t value = (maxCumulative * i + 2U) / 4U;
        sendFmt("<text class='chart-label chart-cum-y-label' x='960' y='%lu'>%lu</text>",
                static_cast<unsigned long>(y + 4U),
                static_cast<unsigned long>(value));
    }
    for (std::uint32_t i = 0; i <= 4; ++i) {
        const std::uint32_t x = left + (chartWidth * i) / 4;
        const std::uint32_t value = (maxEndSec * i + 2U) / 4U;
        sendFmt("<text class='chart-label chart-x-label' x='%lu' y='248'>%lus</text>",
                static_cast<unsigned long>(x),
                static_cast<unsigned long>(value));
    }
    sendFmt("<text class='chart-label' x='58' y='20'>运行最高 %lu 脉冲 / 运行累计 %lu 脉冲</text>",
            static_cast<unsigned long>(maxDelta),
            static_cast<unsigned long>(maxCumulative));
    bool prevPulseValid = false;
    std::uint32_t prevPulseX = left;
    std::uint32_t prevPulseY = baseY;
    for (std::size_t i = 0; i < bucketCount; ++i) {
        const bool bucketRunning = bucketOnlyHasRunningSamples(samples, trace->sampleCount, buckets[i]);
        const std::uint32_t chartDelta =
            bucketRunning ? bucketRunningPulseDelta(samples, trace->sampleCount, buckets[i]) : 0;
        const std::uint32_t startSec = buckets[i].startSec;
        const std::uint32_t endSec = buckets[i].startSec + buckets[i].durationSec;
        const std::uint32_t startX = left + (startSec * chartWidth) / maxEndSec;
        const std::uint32_t x = left + (endSec * chartWidth) / maxEndSec;
        const std::uint32_t y = baseY - (chartDelta * chartHeight) / maxDelta;
        const std::uint32_t lineStartX = bucketRunning && prevPulseValid ? prevPulseX : startX;
        const std::uint32_t lineStartY = bucketRunning && prevPulseValid ? prevPulseY : baseY;
        sendFmt("<line class='%s' x1='%lu' y1='%lu' x2='%lu' y2='%lu'></line>",
                bucketRunning ? "pulse-line" : "pulse-line pulse-line-paused",
                static_cast<unsigned long>(lineStartX),
                static_cast<unsigned long>(lineStartY),
                static_cast<unsigned long>(x),
                static_cast<unsigned long>(y));
        prevPulseValid = bucketRunning;
        prevPulseX = x;
        prevPulseY = y;
    }
    runningCumulative = 0;
    for (std::size_t i = 0; i < bucketCount; ++i) {
        const bool bucketRunning = bucketOnlyHasRunningSamples(samples, trace->sampleCount, buckets[i]);
        const std::uint32_t beforeCumulative = runningCumulative;
        const std::uint32_t chartDelta =
            bucketRunning ? bucketRunningPulseDelta(samples, trace->sampleCount, buckets[i]) : 0;
        if (bucketRunning) {
            runningCumulative += chartDelta;
        }
        const std::uint32_t startSec = buckets[i].startSec;
        const std::uint32_t endSec = buckets[i].startSec + buckets[i].durationSec;
        const std::uint32_t startX = left + (startSec * chartWidth) / maxEndSec;
        const std::uint32_t x = left + (endSec * chartWidth) / maxEndSec;
        const std::uint32_t startY = baseY - (beforeCumulative * chartHeight) / maxCumulative;
        const std::uint32_t y = baseY - (runningCumulative * chartHeight) / maxCumulative;
        sendFmt("<line class='%s' x1='%lu' y1='%lu' x2='%lu' y2='%lu'></line>",
                bucketRunning ? "cum-line" : "cum-line cum-line-paused",
                static_cast<unsigned long>(startX),
                static_cast<unsigned long>(startY),
                static_cast<unsigned long>(x),
                static_cast<unsigned long>(y));
    }
    if (analysis.stable) {
        const std::uint32_t stableX = left + (analysis.stableStartSec * chartWidth) / maxEndSec;
        sendFmt("<line class='stable-line' x1='%lu' y1='%lu' x2='%lu' y2='%lu'></line>"
                "<text class='chart-label' x='%lu' y='42'>稳态 %lus</text>",
                static_cast<unsigned long>(stableX),
                static_cast<unsigned long>(top),
                static_cast<unsigned long>(stableX),
                static_cast<unsigned long>(baseY),
                static_cast<unsigned long>(stableX + 6),
                static_cast<unsigned long>(analysis.stableStartSec));
    }
    runningCumulative = 0;
    for (std::size_t i = 0; i < bucketCount; ++i) {
        const bool bucketRunning = bucketOnlyHasRunningSamples(samples, trace->sampleCount, buckets[i]);
        const std::uint32_t chartDelta =
            bucketRunning ? bucketRunningPulseDelta(samples, trace->sampleCount, buckets[i]) : 0;
        runningCumulative += chartDelta;
        const std::uint32_t endSec = buckets[i].startSec + buckets[i].durationSec;
        const std::uint32_t x = left + (endSec * chartWidth) / maxEndSec;
        const std::uint32_t y = baseY - (chartDelta * chartHeight) / maxDelta;
        sendFmt("<circle class='%s' cx='%lu' cy='%lu' r='2.6'><title>第%lu秒: 运行脉冲数 %lu / 运行累计 %lu / %s</title></circle>",
                bucketRunning ? "pulse-dot" : "pulse-dot pulse-dot-paused",
                static_cast<unsigned long>(x),
                static_cast<unsigned long>(y),
                static_cast<unsigned long>(buckets[i].startSec),
                static_cast<unsigned long>(chartDelta),
                static_cast<unsigned long>(runningCumulative),
                traceStateText(buckets[i].state));
    }
    Esp32BaseWeb::sendChunk("</svg></div><div class='chart-legend'>"
                            "<span><i class='legend-mark legend-pulse'></i>运行脉冲</span>"
                            "<span><i class='legend-mark legend-paused'></i>非运行状态</span>"
                            "<span><i class='legend-mark legend-cum'></i>运行累计</span>"
                            "<span><i class='legend-mark legend-cum-paused'></i>非运行累计</span>"
                            "<span><i class='legend-mark legend-stable'></i>稳态开始</span>"
                            "</div></section>");
    const char* rawSavedParam = savedSource ? "saved=1&" : "";
    const std::size_t rawPreviewCount = rawTracePreviewSampleCount(*trace);
    Esp32BaseWeb::sendChunk("<section class='panel detail-data'><div class='panel-head'><h3>原始明细</h3><div class='row-actions'>");
    sendFmt("<a class='btn-link' target='_blank' rel='noopener' href='/faucet/records/detail?raw=1&%strace=%lu'>显示原始明细</a>",
            rawSavedParam,
            static_cast<unsigned long>(traceId));
    if (trace->sampleCount > rawPreviewCount) {
        sendFmt("<a class='btn-link' target='_blank' rel='noopener' href='/faucet/records/detail?raw=1&%strace=%lu&all=1'>显示所有明细</a>",
                rawSavedParam,
                static_cast<unsigned long>(traceId));
    }
    sendFmt("</div></div><p class='hint'>默认展示 0秒 到 %lu秒；原始秒级数据共 %lu 行，当前展示 %lu 行。</p>"
            "<table class='raw-trace-table'><tr><th>时间</th><th>脉冲数</th><th>累计脉冲数</th><th>状态</th></tr>",
            static_cast<unsigned long>(kRawTracePreviewLastSecond),
            static_cast<unsigned long>(trace->sampleCount),
            static_cast<unsigned long>(rawPreviewCount));
    std::uint32_t rawPreviewCumulative = 0;
    for (std::size_t i = 0; i < rawPreviewCount; ++i) {
        rawPreviewCumulative += samples[i].pulseDelta;
        sendFmt("<tr><td>%lu秒</td><td>%u</td><td>%lu</td><td>%s</td></tr>",
                static_cast<unsigned long>(i),
                static_cast<unsigned>(samples[i].pulseDelta),
                static_cast<unsigned long>(rawPreviewCumulative),
                traceStateText(samples[i].state));
    }
    Esp32BaseWeb::sendChunk("</table></section>");

    delete[] samples;
    delete[] buckets;
    sendPageEnd();
}

