tangyangguang/Esp32_Faucet/src/web/FaucetWeb.cpp
    const std::uint16_t sanitizedPageSize = sanitizeRecordPageSize(static_cast<std::uint16_t>(pageSize));
    WaterRecord* records = new (std::nothrow) WaterRecord[kMaxRecordPageSize]{};
    char* json = new (std::nothrow) char[32768]{};
    if (!records || !json) {
        delete[] records;
        delete[] json;
        Esp32BaseWeb::sendJson(500, "{\"error\":\"oom\"}");
        return;
    }
    const bool ready = g_context.records->ready();
    std::size_t totalCount = 0;
    const std::size_t readCount =
        ready ? queryWaterRecords(*g_context.records, filter, page, sanitizedPageSize, records, kMaxRecordPageSize, &totalCount) : 0;
    sendJsonBuffer(writeWaterRecordsJson(records,
                                      readCount,
                                      page,
                                      sanitizedPageSize,
                                      totalCount,
                                      g_context.records->storageName(),
                                      json,
                                      32768),
                   json);
    delete[] records;
    delete[] json;
}

void handleStatsApi() {
    if (!Esp32BaseWeb::checkAuth() || !requireContext()) {
        return;
    }
    if (waterTaskActive()) {
        Esp32BaseWeb::sendJson(409, "{\"error\":\"busy\"}");
        return;
    }
    char* json = new (std::nothrow) char[8192]{};
    if (!json) {
        Esp32BaseWeb::sendJson(500, "{\"error\":\"oom\"}");
        return;
    }
    const WaterUsageSummary summary = aggregateWaterRecords(*g_context.records, g_context.nowSeconds(), kChartDays);
    const std::uint32_t totalMl = g_context.app->snapshot().statistics.totalMl;
    sendJsonBuffer(writeUsageSummaryJson(summary, totalMl, json, 8192), json);
    delete[] json;
}

void handleRecordCalibrationApi() {
    if (!Esp32BaseWeb::checkAuth() || !requireContext()) {
        return;
    }
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        Esp32BaseWeb::sendJson(405, "{\"error\":\"method_not_allowed\"}");
        return;
    }
    if (waterTaskActive()) {
        Esp32BaseWeb::redirectSeeOther("/faucet/calibration?error=busy");
        return;
    }

    WaterRecord record{};
    if (!g_context.records || !g_context.records->ready() || g_context.records->readPage(0, 1, &record, 1) != 1 ||
        !waterRecordCanCalibrate(record)) {
        Esp32BaseWeb::redirectSeeOther("/faucet/calibration?error=no_calibration_record");
        return;
    }

    char text[32]{};
    std::uint32_t actualMl = 0;
    if (!getParam("actualMl", text, sizeof(text)) || !parseU32(text, actualMl)) {
        Esp32BaseWeb::redirectSeeOther("/faucet/calibration?error=invalid_value");
        return;
    }
    if (actualMl < kMinVolumePresetMl || actualMl > kMaxVolumePresetMl) {
        Esp32BaseWeb::redirectSeeOther("/faucet/calibration?error=invalid_value");
        return;
    }
    const bool saveTrace = checkboxParam("saveTrace");

    WaterRecordCalibration calibration{};
    const bool calibrated = findRecordCalibration(record, calibration);
    const std::uint32_t defaultActualMl = calibrated ? calibration.actualMl : record.volumeMl;
    if (calibrated && actualMl == defaultActualMl) {
        if (saveTrace) {
            autoSaveTraceAsSegmentedSample(record, actualMl);
        }
        Esp32BaseWeb::redirectSeeOther("/faucet/calibration?saved=actual");
        return;
    }

    if (!saveRecordActualMeasurement(record, actualMl)) {
        Esp32BaseWeb::redirectSeeOther("/faucet/calibration?error=calibration_mark_failed");
        return;
    }
    if (saveTrace) {
        autoSaveTraceAsSegmentedSample(record, actualMl);
    }
    Esp32BaseWeb::redirectSeeOther("/faucet/calibration?saved=actual");
}

void handleGenerateSegmentedCalibrationApi() {
    if (!Esp32BaseWeb::checkAuth() || !requireContext()) {
        return;
    }
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        Esp32BaseWeb::sendJson(405, "{\"error\":\"method_not_allowed\"}");
        return;
    }
    if (waterTaskActive()) {
        Esp32BaseWeb::redirectSeeOther("/faucet/calibration?error=busy");
        return;
    }
    if (!generateSegmentedCalibrationCandidateFromSavedSamples()) {
        Esp32BaseWeb::redirectSeeOther("/faucet/calibration?error=sample_not_enough");
        return;
    }
    Esp32BaseWeb::redirectSeeOther("/faucet/calibration?saved=candidate");
}

void handleApplySegmentedCalibrationApi() {
    if (!Esp32BaseWeb::checkAuth() || !requireContext()) {
        return;
    }
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        Esp32BaseWeb::sendJson(405, "{\"error\":\"method_not_allowed\"}");
        return;
    }
    if (waterTaskActive()) {
        Esp32BaseWeb::redirectSeeOther("/faucet/calibration?error=busy");
        return;
    }
    if (!g_context.config || !g_context.config->segmentedCandidateReady) {
        Esp32BaseWeb::redirectSeeOther("/faucet/calibration?error=no_candidate");
        return;
    }
    if (!applySegmentedCalibrationCandidate()) {
        Esp32BaseWeb::redirectSeeOther("/faucet/calibration?error=save_failed");
        return;
    }
    Esp32BaseWeb::redirectSeeOther("/faucet/calibration?saved=applied");
}

void handleRestoreSegmentedCalibrationApi() {
    if (!Esp32BaseWeb::checkAuth() || !requireContext()) {
        return;
    }
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        Esp32BaseWeb::sendJson(405, "{\"error\":\"method_not_allowed\"}");
        return;
    }
    if (waterTaskActive()) {
        Esp32BaseWeb::redirectSeeOther("/faucet/calibration?error=busy");
        return;
    }
    if (!g_context.config || !g_context.config->segmentedPreviousReady) {
        Esp32BaseWeb::redirectSeeOther("/faucet/calibration?error=no_previous");
        return;
    }
    if (!restorePreviousSegmentedCalibration()) {
        Esp32BaseWeb::redirectSeeOther("/faucet/calibration?error=save_failed");
        return;
    }
    Esp32BaseWeb::redirectSeeOther("/faucet/calibration?saved=restored");
}

void handleTraceCalibrationApi() {
    if (!Esp32BaseWeb::checkAuth() || !requireContext()) {
        return;
    }
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        Esp32BaseWeb::sendJson(405, "{\"error\":\"method_not_allowed\"}");
        return;
    }
    char text[32]{};
    std::uint32_t traceId = 0;
    if (getParam("action", text, sizeof(text))) {
        if (std::strcmp(text, "save") == 0) {
            handleTraceSaveApi();
            return;
        }
        if (std::strcmp(text, "delete") == 0) {
            handleTraceDeleteApi();
            return;
        }
    }
    if (!g_context.pulseTraces) {
        Esp32BaseWeb::redirectSeeOther("/faucet/records?error=no_calibration_record");
        return;
    }
    std::uint32_t actualMl = 0;
    if (!getParam("trace", text, sizeof(text)) || !parseU32(text, traceId) ||
        !getParam("actualMl", text, sizeof(text)) || !parseU32(text, actualMl) ||
        actualMl < kMinVolumePresetMl || actualMl > kMaxVolumePresetMl) {
        Esp32BaseWeb::redirectSeeOther("/faucet/records?error=invalid_value");
        return;
    }
    if (!g_context.pulseTraces->setActualMl(traceId, actualMl)) {
        Esp32BaseWeb::redirectSeeOther("/faucet/records?error=no_calibration_record");
        return;
    }

